const errorJSON = {
  1001: "该手机号已经注册！",
  1002: "登录失败，不存在该用户！",
  1003: "登录失败，密码错误！",
  1004: "登录过期，请重新登录!",
  1005: "用户未登录",
  1006: "获取用户详情失败！",
  1007: "该用户已经登录,请先退出其他登录！",
  1010: "查询用户失败",
  1020: "修改密码失败！",
  1021: "修改密码失败，密码错误！",
  1030: "查询信息失败",
  1040: "密码中需包含字母、数字，长度6至12位!",
  1041: "手机号格式错误！",
  1042: "昵称的长度应在2至6位!",
  1050: "创建群聊失败，该用户最多创建3个群组！",
  1051: "创建群聊失败！",
  1052: "创建群聊成员失败！",
  1053: "添加群聊成员失败！",
  1054: "未查询到群聊！",
  1055: "查询群成员失败！",
  1056: "群聊信息获取失败！",
  1057: "查询群聊失败！",
  2000: "请确认表单信息的格式是否正确！",
};

export const getErrorJSON = (code: number) => {
  const msg = errorJSON[code];
  if (msg) {
    return { code, msg };
  }
  return { code: -1, msg: "未定义该错误" };
};
